fixtures/demo_my_test/src/Enums/ИспользоватьПровайдерГеопозиционирования/ИспользоватьПровайдерГеопозиционирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИспользоватьПровайдерГеопозиционирования</name>
  <enumValues>
    <name>СамыйТочныйПровайдер</name>
  </enumValues>
  <enumValues>
    <name>СамыйЭкономичныйПровайдер</name>
  </enumValues>
  <enumValues>
    <name>ВыбиратьИзСписка</name>
  </enumValues>
</mdclass:Enum>

fixtures/demo_my_test/src/CommonForms/НастройкиМобильногоУстройства/Module.bsl
//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// Процедура записывает настройки в БД. При необходимости, обновляет повторно используемые значения
//
&НаСервере
Процедура ЗаписатьКонстанты()
    
    Набор = РеквизитФормыВЗначение("НаборКонстант");
    Набор.Записать();
    ЗначениеВРеквизитФормы(Набор, "НаборКонстант");
    Модифицированность = Ложь;

КонецПроцедуры

// Процедура перестраивает форму по выбранному типу провайдера
//
&НаКлиенте
Процедура УстановитьИмяПровайдера()
	
	СпособВыбора = НаборКонстант.ВыборПровайдераГеопозиционирования;
	Если СпособВыбора = ПредопределенноеЗначение("Перечисление.ИспользоватьПровайдерГеопозиционирования.ВыбиратьИзСписка") Тогда
		Элементы.НаборКонстантИмяПровайдера.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.НаборКонстантИмяПровайдера.ТолькоПросмотр = Истина;
#Если МобильныйКлиент Тогда
		Провайдер = Неопределено;
		Если СпособВыбора = ПредопределенноеЗначение("Перечисление.ИспользоватьПровайдерГеопозиционирования.СамыйЭкономичныйПровайдер") Тогда
			Провайдер = СредстваГеопозиционирования.ПолучитьСамогоЭнергоЭкономичногоПровайдера();
		ИначеЕсли СпособВыбора = ПредопределенноеЗначение("Перечисление.ИспользоватьПровайдерГеопозиционирования.СамыйТочныйПровайдер") Тогда
			Провайдер = СредстваГеопозиционирования.ПолучитьСамогоТочногоПровайдера();
		КонецЕсли;
		Если Провайдер = Неопределено Тогда
			НаборКонстант.ИмяПровайдера = "";
		Иначе
			НаборКонстант.ИмяПровайдера = Провайдер.Имя;
		КонецЕсли;
		ЗаписатьКонстанты();
#КонецЕсли
	КонецЕсли;

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ 
// 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Набор = Константы.СоздатьНабор();
    Набор.Прочитать();
    ЗначениеВРеквизитФормы(Набор, "НаборКонстант");
	
	Элементы.НаборКонстантИмяПровайдера.ТолькоПросмотр = НаборКонстант.ВыборПровайдераГеопозиционирования <> Перечисления.ИспользоватьПровайдерГеопозиционирования.ВыбиратьИзСписка;
	
	ПереключитьСтраницу = Ложь;
	Если Параметры.Свойство("Геопозиционирование",ПереключитьСтраницу) И ПереключитьСтраницу Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.Геопозиционирование;
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьИмяПровайдера();
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантТолькоБесплатныеПриИзменении(Элемент)
    
    ЗаписатьКонстанты();
    
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьСотовуюСетьПриИзменении(Элемент)
    
    ЗаписатьКонстанты();
    
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьСетьПередачиДанныхПриИзменении(Элемент)
    
    ЗаписатьКонстанты();
    
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьСпутникиПриИзменении(Элемент)
    
    ЗаписатьКонстанты();
    
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВыборПровайдераГеопозиционированияПриИзменении(Элемент)
	
	ЗаписатьКонстанты();
	УстановитьИмяПровайдера();
    
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИмяПровайдераПриИзменении(Элемент)
    
    ЗаписатьКонстанты();
    
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИмяПровайдераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
#Если МобильныйКлиент Тогда
	ДанныеВыбора = Новый СписокЗначений();
	Массив = СредстваГеопозиционирования.ПолучитьПровайдеров();
	Для Каждого Провайдер Из Массив Цикл
		Если НаборКонстант.ТолькоБесплатные И Провайдер.Платный Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ НаборКонстант.ИспользоватьСотовуюСеть И Провайдер.ИспользуетСотовуюСеть Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ НаборКонстант.ИспользоватьСетьПередачиДанных И Провайдер.ИспользуетСетьПередачиДанных Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ НаборКонстант.ИспользоватьСпутники И Провайдер.ИспользуетСпутники Тогда
			Продолжить;
		КонецЕсли;
		ДанныеВыбора.Добавить(Провайдер.Имя);
	КонецЦикла;
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВоспроизводитьТекстУведомленияПриИзменении(Элемент)
    
    ЗаписатьКонстанты();
    
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОтметкаНаФотоснимкеДатаПриИзменении(Элемент)
    
    ЗаписатьКонстанты();
    
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОтметкаНаФотоснимкеТекстПриИзменении(Элемент)
    
    ЗаписатьКонстанты();
    
КонецПроцедуры
